app/controllers/boards_controller.rb

SELECT * FROM "boards"
---
  def index
    @boards = Board.all

SELECT * FROM "boards" WHERE ("boards"."id" = 1)
---
  def show
    @board = Board.find(params[:id])

SELECT * FROM "boards" WHERE ("boards"."id" = 1)
---
  def edit
    @board = Board.find(params[:id])

INSERT INTO "boards" ("name", "created_at", "updated_at") VALUES('random', '2010-12-02 13:39:53', '2010-12-02 13:39:53')
---
  def create
    @board = Board.new(params[:board])

    respond_to do |format|
      if @board.save

SELECT * FROM "boards" WHERE ("boards"."id" = 1)
UPDATE "boards" SET "updated_at" = '2010-12-02 13:48:55', "name" = 'meta' WHERE "id" = 1
---
  def update
    @board = Board.find(params[:id])

    respond_to do |format|
      if @board.update_attributes(params[:board])